{
    "title": "شروط استخدام Voltyks",
    "sections": [
        {
            "key": "eligibility",
            "title": "الأهلية",
            "items": [
                "يجب أن يكون عمرك 18 عامًا على الأقل.",
                "يجب أن تحمل رخصة قيادة سارية."
            ]
        },
        {
            "key": "use_of_service",
            "title": "استخدام الخدمة",
            "items": [
                "توفر Voltyks منصة تربط مالكي المركبات الكهربائية بمقدمي خدمات الشحن.",
                "يمكن للمستخدمين: طلب الوصول لمحطات الشحن المدرجة بالتطبيق، أو عرض شواحنهم ليستفيد منها الآخرون مقابل دفع.",
                "Voltyks مجرد وسيط. لا نملك أو ندير أي شواحن."
            ]
        },
        {
            "key": "fees_payments",
            "title": "الرسوم والمدفوعات",
            "items": [
                "قد تفرض Voltyks رسم خدمة لتيسير الربط بين المستخدمين.",
                "أسعار الشحن يحددها مالكو الشواحن فقط، ولا تتحكم Voltyks في التسعير.",
                "تسوية المدفوعات تتم مباشرة بين المستخدمين؛ وVoltyks غير مسؤولة عن نزاعات الدفع الخارجية.",
                "رسوم Voltyks غير قابلة للاسترداد نهائيًا في جميع الأحوال، وباستخدام التطبيق فأنت تقرّ بذلك."
            ]
        },
        {
            "key": "wallet_dues",
            "title": "المحفظة والمستحقات",
            "items": [
                "لكل مستخدم محفظة Voltyks قد تُظهر أرصدة أو اعتمادات أو مستحقات.",
                "في حالات إساءة الاستخدام أو الاحتيال أو عدم السداد، تحتفظ Voltyks بالحق في فرض أرصدة سلبية (مستحقات).",
                "يجب سداد هذه المستحقات وقد تُخصم تلقائيًا من أي استخدام مستقبلي للتطبيق.",
                "قد يُمنح المستخدمون المتضررون من الاحتيال اعتمادات مناسبة في محافظهم للاستخدام لاحقًا."
            ]
        },
        {
            "key": "user_responsibilities",
            "title": "مسؤوليات المستخدم",
            "items": [
                "على المستخدمين تقديم معلومات دقيقة ومكتملة عن الهوية والمركبة والشاحن.",
                "يتحمل المستخدمون مسؤولية السلامة والتوافق والاستخدام القانوني للشواحن.",
                "قد تؤدي إساءة الاستخدام أو الاحتيال أو الإخلال بالالتزامات إلى تعليق أو إنهاء الحساب أو فرض جزاءات مالية على المحفظة."
            ]
        },
        {
            "key": "liability_disclaimers",
            "title": "إخلاء المسؤولية",
            "items": [
                "لا تضمن Voltyks جودة الشواحن أو توفرها أو سلامتها أو ملاءمتها.",
                "لا تتحمل Voltyks أي مسؤولية عن الأضرار أو الخسائر أو النزاعات بين المستخدمين.",
                "يُنصح المستخدمون بمراجعة التقييمات واتخاذ قرارات مستنيرة قبل أي تعامل."
            ]
        },
        {
            "key": "termination",
            "title": "الإنهاء",
            "items": [
                "قد نقوم بتعليق أو إنهاء الحسابات المخالفة لهذه الشروط أو المتورطة في سوء سلوك."
            ]
        },
        {
            "key": "support",
            "title": "الدعم",
            "items": [
                "يمكن التواصل عبر نظام الدعم داخل التطبيق لطلب المساعدة أو الإبلاغ عن المشاكل."
            ]
        },
        {
            "key": "amendments",
            "title": "التعديلات",
            "items": [
                "تحتفظ Voltyks بالحق في تحديث هذه الشروط في أي وقت، ويُعد استمرار الاستخدام موافقة على النسخة المحدّثة."
            ]
        }
    ]
}
